# 2.3.3	字典
#（1）字典的定义

lon_dict = {'a1': 118.773, 'a2': 118.778, 'a3': 118.781, 'a4':118.783}

#（2）字典的取值
lon_dict['a2']             	#结果为118.778    
lon_dict.get('a5', 0)        	#第一个参数为所需要查找的键，第二个参数为查找不到时返回的值，此处返回0
#（3）字典元素的增删
lon_dict.pop('a2')         	#删除键为'a2'的条目    
lon_dict['a5'] = 118.797   	#直接增加一个条目    
#（4）取出字典的键值
lon_dict.keys()      	#取出字典的键
lon_dict.values()    	#取出字典的值
lon_dict.items()     	#取出字典的键值对
# 3.3.4	集合
s = set([1, 2, 2, 3])      	#输出为{1, 2, 3}  
#（2）集合元素的增删
s.add(4)                  #输出为{1, 2, 3, 4}  
s.remove(3)               #输出为{1, 2, 4}  
#（3）集合的运算
s = set([1, 2, 3])
p = set([3, 4, 5])
s & p           	#交集，输出为{3}
s | p           		#并集，输出为{1, 2, 3, 4, 5}
s - p           		#等价于s-s∩p，输出为{1, 2}
p - s           	#等价于p-s∩p，输出为{4, 5}